# Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. 
Создайте датафрейм authors со столбцами author_id и author_name, 
в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price,
в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290]

In [2]:
import pandas as pd

In [3]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'authors_name': ['Тургенев', 'Чехов', 'Островский']},
                      columns = ['author_id', 'authors_name'])

In [4]:
authors

   author_id authors_name
0          1     Тургенев
1          2        Чехов
2          3   Островский

In [5]:
books = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 'book_title': 
                      ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 
                       'Толстый и тонкий', 'Дама с собачкой', 
                       'Гроза', 'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290]},
                    columns = ['author_id', 'book_title', 'price'])

In [6]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

# Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [8]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'inner')
authors_price

   author_id authors_name            book_title  price
0          1     Тургенев           Отцы и дети    450
1          1     Тургенев                 Рудин    300
2          1     Тургенев     Дворянское гнездо    350
3          2        Чехов      Толстый и тонкий    500
4          2        Чехов       Дама с собачкой    450
5          3   Островский                 Гроза    370
6          3   Островский  Таланты и поклонники    290

# Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [10]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id authors_name         book_title  price
3          2        Чехов   Толстый и тонкий    500
0          1     Тургенев        Отцы и дети    450
4          2        Чехов    Дама с собачкой    450
5          3   Островский              Гроза    370
2          1     Тургенев  Дворянское гнездо    350

# Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. 
В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно
имя автора,минимальная, максимальная и средняя цена на книги этого автора.

In [12]:
authors_max = authors_price.groupby('authors_name')['price'].max()

In [13]:
authors_max

authors_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [45]:
import numpy as np

authors_stat = pd.DataFrame(authors_price).groupby('authors_name')['price'].agg(['min','mean', max]).rename(columns={'min': 'price_min','mean': 'price_mean', 'max' : 'price_max'})
authors_stat

              price_min  price_mean  price_max
authors_name
Островский          290  330.000000        370
Тургенев            300  366.666667        450
Чехов               450  475.000000        500